[
  {
    "author": "Harriet Van Horne",
    "quote": "Cooking is like love. It should be entered into with abandon or not at all."
  },
  {
    "author": "Julia Child",
    "quote": "The only real stumbling block is fear of failure. In cooking, you've got to have a what-the-hell attitude."
  },
  {
    "author": "Craig Claiborne",
    "quote": "Cooking is at once child's play and adult joy. And cooking done with care is an act of love."
  },
  {
    "author": "Thomas Keller",
    "quote": "A recipe has no soul. You, as the cook, must bring soul to the recipe."
  },
  {
    "author": "Alton Brown",
    "quote": "Cooking is an observation-based process that you can’t do if you’re so completely focused on a recipe."
  },
  {
    "author": "Ted Allen",
    "quote": "The kitchen is a place of adventure and entirely yours. Remember, it’s not just the cooking, but the company that makes a meal."
  },
  {
    "author": "Luciano Pavarotti",
    "quote": "One of the very nicest things about life is the way we must regularly stop whatever it is we are doing and devote our attention to eating."
  },
  {
    "author": "Julia Child",
    "quote": "No one is born a great cook, one learns by doing."
  },
  { "author": "Jacques Pepin", "quote": "Cooking is the art of adjustment." },
  {
    "author": "Unknown",
    "quote": "Good food is all the sweeter when shared with good friends."
  },
  {
    "author": "Auguste Escoffier",
    "quote": "The greatest dishes are very simple."
  },
  {
    "author": "Gordon Ramsay",
    "quote": "Cooking is about passion, so it may look slightly temperamental in a way that it's too assertive to the naked eye."
  },
  {
    "author": "Julia Child",
    "quote": "Cooking well doesn’t mean cooking fancy."
  },
  {
    "author": "James Beard",
    "quote": "The secret of good cooking is, first, having a love of it."
  },
  {
    "author": "Craig Claiborne",
    "quote": "Cooking done with care is an act of love."
  },
  { "author": "Jamie Oliver", "quote": "Cooking is the ultimate giving." },
  {
    "author": "François de La Rochefoucauld",
    "quote": "To eat is a necessity, but to eat intelligently is an art."
  },
  {
    "author": "Elsa Schiaparelli",
    "quote": "A good cook is like a sorceress who dispenses happiness."
  },
  { "author": "Unknown", "quote": "Cooking is love made visible." }
]
